public class MinusTwoIteration {
    //Напишите цикл for, в котором перебирались бы значения от 1000 до О с шагом -2.
    public static void main(String [] args){

        int minustwo;

        for (minustwo = 20; minustwo > 0; minustwo -= 2){
            System.out.println(minustwo);
        }

    }

}
